# DBSQLExecuteDelete

## Description
Deletes a resultSetInstance created with 'DBSQLExecute' or 'DBSQLExecuteDSN'

```pascal
PROCEDURE DBSQLExecuteDelete(VAR resultSetInst : LONGINT);
```

```python
def vs.DBSQLExecuteDelete():
    return resultSetInst
```

## Parameters
|Name|Type|Description|
|---|---|---|
|resultSetInst|LONGINT|   |

## Examples
DBSQLExecuteDSN

```pascal
DBSQLExecuteDelete(1);
```
```python
import vs

# Deletes a resultSetInstance created with 'DBSQLExecute' or 'DBSQLExecuteDSN'.
result = vs.DBSQLExecuteDelete()
```

## See Also
DBSQLExecuteDSN | DBSQLExecute

## Version
Availability: from Vectorworks 2011

## Category
* ODBC